export const NIGHTMARE_WEAPONS = {
  '噩梦MG': [],
  '噩梦御守珠': [],
  '噩梦战击拐杖': [],
  '噩梦长拳套': [],
  '噩梦拳套': [],
  '噩梦短剑': [],
  '噩梦幸运盾牌': [],
  '噩梦盾牌': [],
  '噩梦双刀': {
    props: ['最小攻击力+1218', '最大攻击力+1254', '物理爆击率+7%', '物理最小/最大伤害 +66%', '力量+5100', '目标物理防御力减少35%', '物理爆击伤害+18%', '力量+3%', '物理伤害+4000'],
    weaponType: '双刀',
    job: '剑斗士系列'
  },
}
/** 噩梦武器自带属性 */
export const NIGHTMARE_DEFAULT = ['噩梦的气息(每次强化增加属性力 / 武器伤害 5% , 所有能力值 650)', '打击时以 0.3%的机率召唤噩梦的火焰', '打击时以 0.1%的机率召唤噩梦的刀刃 ( 每次强化增加0.02% 机率 ) ']
/** 所有属性 */
export const PROPERTY = {}