export const NIGHTMARE_WEAPONS = {
  '噩夢拳套': {},
  '噩夢短劍': {},
  '噩夢單手劍': {},
  '噩夢雙手劍': {},
  '噩夢魔法球': {},
  '噩夢雙刀': {
    props: [
      '最小攻击力+1218', '最大攻击力+1254',
      '物理爆击率+7%', '物理最小/最大伤害 +66%',
      '力量+5100',
      '目标物理防御力减少35%',
      '物理爆击伤害+18%', '力量+3%',
      '物理伤害+4000'
    ],
    weaponType: '双刀',
    job: '剑斗士系列'
  },
  '噩夢鈍器': {},
  '噩夢利矛': {},
  '噩夢弓箭': {},
  '噩夢十字弓': {},
  '噩夢法杖': {},
  '噩夢吉他': {},
  '噩夢雙槍': {},
  '噩夢MG': {},
  '噩夢螺旋劍': {},
  '噩夢飛燕劍': {},
  '噩夢長拳套': {},
  '噩夢神擊手': {},
  '噩夢音樂權杖': {},
  '噩夢盜賊短劍': {},
  '噩夢神槍劍': {},
  '噩夢禦守珠': {},
  '噩夢戰擊拐杖': {},
  '噩夢靈魂': {},
  '噩夢盾牌': {},
  '噩夢魔力卡片': {},
  '噩夢黑狼玉': {},
  '噩夢幸運盾牌': {},
  '噩夢魔法權杖': {},
  '噩夢精靈石': {},
  '力量的噩夢精靈石': {},
  '混沌的噩夢精靈石': {},
  '噩夢爆焰巨錘': {},
  '噩夢鎖鏈劍': {},
  '噩夢寶石短錐': {},
  '噩夢長矛': {},
}
/** 噩梦武器自带属性 */
export const NIGHTMARE_DEFAULT = [
  '噩梦的气息(每次强化增加属性力 / 武器伤害 5% , 所有能力值 650)',
  '打击时以 0.3%的机率召唤噩梦的火焰',
  '打击时以 0.1%的机率召唤噩梦的刀刃 ( 每次强化增加0.02% 机率 ) '
]
/** 所有属性 */
export const PROPERTY = {}